lamer0k/CortexLib/Tools/RegistersGenerator/MDR1986VK234.svd
        <!-- #ADC2_Status -->
        <!-- ADC1_CHSEL -->
        <register>
          <name>ADC1_CHSEL</name>
          <description>ADC channels select register</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <!-- #ADC1_CHSEL_RMASK -->
          <resetMask>0xC00000FF</resetMask>
          <fields>
            <!-- #ADC1_CHSEL_ITEMS -->
            <field><name>Channel_0</name><description>Signal on PC4, Ref-</description><bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Not used in channels switching</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Selected</name><description>Using in channels switching</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="Channel_0"><name>Channel_1</name><description>Signal on PC3, Ref+</description><bitRange>[1:1]</bitRange></field>
            <field derivedFrom="Channel_0"><name>Channel_2</name><description>Signal on PC2</description><bitRange>[2:2]</bitRange></field>
            <field derivedFrom="Channel_0"><name>Channel_3</name><description>Signal on PC1</description><bitRange>[3:3]</bitRange></field>
            <field derivedFrom="Channel_0"><name>Channel_4</name><description>Signal on PB9</description><bitRange>[4:4]</bitRange></field>
            <field derivedFrom="Channel_0"><name>Channel_5</name><description>Signal on PB8</description><bitRange>[5:5]</bitRange></field>
            <field derivedFrom="Channel_0"><name>Channel_6</name><description>Signal on PB7</description><bitRange>[6:6]</bitRange></field>
            <field derivedFrom="Channel_0"><name>Channel_7</name><description>Signal on PB6</description><bitRange>[7:7]</bitRange></field>
            <field derivedFrom="Channel_0"><name>Channel_30</name><description>VRef from Thermosensor</description><bitRange>[30:30]</bitRange></field>
            <field derivedFrom="Channel_0"><name>Channel_31</name><description>Temperature from Thermosensor</description><bitRange>[31:31]</bitRange></field>
          </fields>    
        </register>
        <!-- #ADC2_REG_CHSEL -->    
        <!-- #ADC1_REG_TRIM -->
        <register>
          <name>ADC1_TRIM</name>
          <description>ADC TS_Vref trim register</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001E</resetMask>
          <fields>
            <field>
              <name>TS_Trim</name>
              <description>Trim Vref from Thermosensor</description>
              <bitRange>[5:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue><name>Vref_1v23</name><description>1.23V typically</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Vref_1v213</name><description>1.213V typically</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>Vref_1v211</name><description>1.211V typically</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>Vref_1v208</name><description>1.208V typically</description><value>3</value></enumeratedValue>
                <enumeratedValue><name>Vref_1v206</name><description>1.206V typically</description><value>4</value></enumeratedValue>
                <enumeratedValue><name>Vref_1v203</name><description>1.203V typically</description><value>5</value></enumeratedValue>
                <enumeratedValue><name>Vref_1v200</name><description>1.200V typically</description><value>6</value></enumeratedValue>
                <enumeratedValue><name>Vref_1v197</name><description>1.197V typically</description><value>7</value></enumeratedValue>
                <enumeratedValue><name>Vref_1v193</name><description>1.193V typically</description><value>8</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEL_VREF_BUF</name>
              <description>Output Vref_Buf=1.23 from Thermosensor</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Channel 30 signal is undefined</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Selected</name>
                  <description>Channel 30 signal is VRef_Buf</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>     
          </fields>
        </register>
        <!-- Registers end-->
      </registers>
      <!-- peripheral end-->
    </peripheral>
    <!-- #BKP -->
    <!-- BKP and RTC -->
    <peripheral>
      <name>MDR_BKP</name>
      <version>1.0</version>
      <description>Backup and RTC Control</description>
      <groupName>BKP and RTC</groupName>
      <!-- #BKP_ADDR -->
      <baseAddress>0x40060000</baseAddress>
      <size>32</size>
      <access>read-write</access>
      <addressBlock>
        <offset>0</offset>
        <size>0x54</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <!-- REG_x -->
        <register>
          <dim>14</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0,1,2,3,4,5,6,7,8,9,A,B,C,D</dimIndex>
          <name>REG_0%s</name>
          <description>User backup registers</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
