lamer0k/CortexLib/Tools/RegistersGenerator/MDR1986VK234.svd
    <!-- #ADCUI -->
    <peripheral>
      <name>MDR_ADCUI</name>
      <version>2.0</version>
      <description>Energy Counter Block</description>
      <groupName>ADCUI</groupName>
      <baseAddress>0x40068000</baseAddress>
      <size>32</size>
      <access>read-write</access>
      <addressBlock>
        <offset>0</offset>
        <size>0x124</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <!-- CTRL1 -->
        <register>
          <name>CTRL1</name>
          <description>ADCUI Control1 Register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xF83FBFC3</resetMask>
          <fields>
            <field>
              <name>I0EN</name>
              <description>Channel enable</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Disabled</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>Enabled</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="I0EN">
              <name>V0EN</name><bitRange>[1:1]</bitRange>
            </field>
            <field derivedFrom="I0EN">
              <name>I1EN</name><bitRange>[2:2]</bitRange>
            </field>
            <field derivedFrom="I0EN">
              <name>V1EN</name><bitRange>[3:3]</bitRange>
            </field>
            <field derivedFrom="I0EN">
              <name>I2EN</name><bitRange>[4:4]</bitRange>
            </field>
            <field derivedFrom="I0EN">
              <name>V2EN</name><bitRange>[5:5]</bitRange>
            </field>
            <field derivedFrom="I0EN">
              <name>I3EN</name><bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RESOL</name>
              <description>Data resolution</description>
              <bitRange>[7:7]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>bit_16</name><description>16 bit data</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>bit_24</name><description>24 bit data</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ZXLPF</name>
              <description>V0 cross zero LPF enable</description>
              <bitRange>[8:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>On</name><description>Enabled</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Off</name><description>Disable</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PER_Length</name>
              <description>Period to calc aver period and dPhase</description>
              <bitRange>[11:9]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Period_1</name><description>1 period</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Period_2</name><description>2 periods</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>Period_3</name><description>4 periods</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>Period_4</name><description>8 periods</description><value>3</value></enumeratedValue>
                <enumeratedValue><name>Period_5</name><description>16 periods</description><value>4</value></enumeratedValue>
                <enumeratedValue><name>Period_6</name><description>32 periods</description><value>5</value></enumeratedValue>
                <enumeratedValue><name>Period_7</name><description>64 periods</description><value>6</value></enumeratedValue>
                <enumeratedValue><name>Period_8</name><description>128 periods</description><value>7</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>APNOLOAD</name>
              <description>Active Energy min level to accumulate</description>
              <bitRange>[13:12]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>All</name><description>Accunulate All Energy</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>lv_012</name><description>Pass E less than 0.012%</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>lv_0061</name><description>Pass E less than 0.0061%</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>lv_00305</name><description>Pass E less than 0.00305%</description><value>3</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="APNOLOAD">
              <name>VARNOLOAD</name>
              <description>Reactive Energy min level to accumulate</description>
              <bitRange>[16:15]</bitRange>
            </field>
            <field derivedFrom="APNOLOAD">
              <name>VANOLOAD</name>
              <description>Full Energy min level to accumulate</description>
              <bitRange>[18:17]</bitRange>
            </field>
            <field>
              <name>FREQSEL</name>
              <description>Enable V0 period detection to FxMD0.PER_FREQ</description>
              <bitRange>[19:19]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Hold Last value</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>Enabled</description><value>1</value></enumeratedValue>
              </enumeratedValues>          
            </field>
            <field>
              <name>VREF_SEL</name>
              <description>ADC Vref select</description>
              <bitRange>[20:20]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Internal</name><description>Internal Vref source</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>External</name><description>External Vref source</description><value>1</value></enumeratedValue>
              </enumeratedValues>          
            </field>
            <field>
              <name>BUF_BYP</name>
              <description>Bypass Vref buffer</description>
              <bitRange>[21:21]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Buffered</name><description>Vref through buffer</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>NotBuffered</name><description>Vref bypass buffer</description><value>1</value></enumeratedValue>
              </enumeratedValues>          
            </field>
            <field>
              <name>CHOP_EN</name>
              <description>Chopper Mode Select</description>
              <bitRange>[22:22]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Normal</name><description>Normal mode</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Chopper</name><description>Chopper mode</description><value>1</value></enumeratedValue>
              </enumeratedValues>          
            </field>
            <field>
              <name>CHOP_FREQ</name>
              <description>Chopper Frequency</description>
              <bitRange>[24:23]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>fADC_div2</name><description>ADC freq div 2</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>fADC_div4</name><description>ADC freq div 4</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>fADC_div8</name><description>ADC freq div 8</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>fADC_div16</name><description>ADC freq div 16</description><value>3</value></enumeratedValue>            
              </enumeratedValues>          
            </field>
            <field>
              <name>ZXRMS</name>
              <description>RMS Update mode</description>
              <bitRange>[27:27]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Continuous</name><description>Continuous RMS update</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>OnZeroV0</name><description>Update on V0 cross zero level</description><value>1</value></enumeratedValue>
              </enumeratedValues>          
            </field>
            <field>
              <name>RESET_DIG</name>
              <description>Digital Logic Reset</description>
              <bitRange>[28:28]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Inactive</name><description>Working mode</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Reset</name><description>Logic in reset</description><value>1</value></enumeratedValue>
              </enumeratedValues>          
            </field>
            <field>
              <name>IBOOST</name>
              <description>Boost I mode</description>
              <bitRange>[29:29]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Normal</name><description>Working mode</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Boost</name><description>Boost I enabled</description><value>1</value></enumeratedValue>
              </enumeratedValues>          
            </field>
            <field>
              <name>OSR_CONF</name>
              <description>ADC Output Sampling Rate</description>
              <bitRange>[31:30]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>4kHz</name><description>Sampling at 4kHz</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>8kHz</name><description>Sampling at 8kHz</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>16kHz</name><description>Sampling at 16kHz</description><value>2</value></enumeratedValue>
              </enumeratedValues>          
            </field>
          </fields>
        </register>
