lamer0k/CortexLib/Tools/RegistersGenerator/MDR1986VK234.svd
        <!-- F0WATTN -->
        <register>
          <name>F0WATTN</name>
          <description>Negative Active Energy accumulator</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>      
          <fields>
            <field>
              <name>WATTHRN</name>
              <description>High 32 bits of 57bits Accumulator</description>
              <bitRange>[31:0]</bitRange>          
            </field>
          </fields>
        </register>
        <!-- F0VC -->
        <register>
          <name>F0VC</name>
          <description>Reactive energy calibration</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0FFFFFFF</resetMask>
          <fields>
            <field>
              <name>VAROS</name>
              <description>Calibr bias of reactive energy</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>VARGAIN</name>
              <description>Calibr gain of reactive energy</description>
              <bitRange>[27:16]</bitRange>
            </field>
          </fields>
        </register>
        <!-- F0VARP -->
        <register>
          <name>F0VARP</name>
          <description>Positive Reactive Energy accumulator</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VARHRP</name>
              <description>High 32 bits of of 57bits Accumulator</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <!-- F0VARN -->
        <register>
          <name>F0VARN</name>
          <description>Negative Reactive Energy accumulator</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>      
          <fields>
            <field>
              <name>VARHRN</name>
              <description>High 32 bits of of 57bits Accumulator</description>
              <bitRange>[31:0]</bitRange>          
            </field>
          </fields>
        </register>
        <!-- F0AC -->
        <register>
          <name>F0AC</name>
          <description>V0 RMS calibration</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0FFF0FFF</resetMask>
          <fields>
            <field>
              <name>VRMSOS</name>
              <description>Calibr bias of V0 RMS</description>
              <bitRange>[11:0]</bitRange>
            </field>
            <field>
              <name>VAGAIN</name>
              <description>Calibr gain of Full energy</description>
              <bitRange>[27:16]</bitRange>
            </field>
          </fields>
        </register>
        <!-- F0VR -->
        <register>
          <name>F0VR</name>
          <description>Full Energy accumulator</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VAHR</name>
              <description>High 32 bits of of 57bits Accumulator</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <!-- F0MD0 -->
        <register>
          <name>F0MD0</name>
          <description>FxMD0 register</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFF1FF</resetMask>
          <fields>
            <field>
              <name>VSEL</name>
              <description>Select source for FxVDAT</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>ADC_V</name><description>ADC_V output</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>ActivePower</name><description>Active Power</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>ReactivePower</name><description>Reactive Power</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>FullPower</name><description>Full Power</description><value>3</value></enumeratedValue>
              </enumeratedValues>          
            </field>
            <field>
              <name>ISEL</name>
              <description>Select source for FxI0DAT</description>
              <bitRange>[3:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>ADC_I0</name><description>ADC_I0 output</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>ActivePower</name><description>Active Power</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>ReactivePower</name><description>Reactive Power</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>FullPower</name><description>Full Power</description><value>3</value></enumeratedValue>
              </enumeratedValues>          
            </field>
            <field>
              <name>ACTS</name>
              <description>Active Energy sign in last period</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue><name>Pos</name><description>Positive sign</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Neg</name><description>Negative sign</description><value>1</value></enumeratedValue>
              </enumeratedValues>          
            </field>
            <field derivedFrom="ACTS">
              <name>REACTS</name>
              <description>Reactive Energy sign in last period</description>
              <bitRange>[5:5]</bitRange>         
            </field>
            <field>
              <name>V0GAIN</name>
              <description>ADC Decimation gain</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue><name>x1</name><description>No gain</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>x2</name><description>Gain by +6dB</description><value>1</value></enumeratedValue>
              </enumeratedValues>          
            </field>
            <field derivedFrom="V0GAIN">
              <name>IOGAIN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field derivedFrom="V0GAIN">
              <name>I3GAIN</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>PER_FREQ</name>
              <description>Measured period of V</description>
              <bitRange>[28:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>I3SEL</name>
              <description>Select source for FxI3DAT</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue><name>I3_LPF</name><description>Signal after LPF</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>ADC_I3</name><description>ADC_I3 output</description><value>1</value></enumeratedValue>
              </enumeratedValues>          
            </field>
            <field>
              <name>SEL_I_CH</name>
              <description>Select I for calc power</description>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue><name>Auto_max</name><description>Select max of I0 and I3</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>I0</name><description>Calc Power by I0</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>I3</name><description>Calc Power by I3</description><value>2</value></enumeratedValue>
              </enumeratedValues>          
            </field>
          </fields>
        </register>
