lamer0k/CortexLib/Tools/RegistersGenerator/MDR1986VK234.svd
        <!-- F0MD1 -->
        <register>
          <name>F0MD1</name>
          <description>FxMD1 register</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>IPKLVL</name>
              <description>Imax level</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>VPKLVL</name>
              <description>Vmax level</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <!-- F0VPEAK -->
        <register>
          <name>F0VPEAK</name>
          <description>VPEAK Result register</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>IPEAK</name>
              <description>Vmax measured, write any to clear</description>
              <bitRange>[23:0]</bitRange>
            </field>
          </fields>
        </register>
        <!-- F0IPEAK -->
        <register>
          <name>F0IPEAK</name>
          <description>IPEAK Result register</description>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>IPEAK</name>
              <description>Imax measured, write any to clear</description>
              <bitRange>[23:0]</bitRange>
            </field>
          </fields>
        </register>    
        <!-- F0VDAT -->
        <register>
          <name>F0VDAT</name>
          <description>VDAT Result register</description>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>VDAT</name>
              <description>FIFO of V or Power</description>
              <bitRange>[23:0]</bitRange>
            </field>
          </fields>
        </register>
        <!-- F0I0DAT -->
        <register>
          <name>F0I0DAT</name>
          <description>I0DAT Result register</description>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>I0DAT</name>
              <description>FIFO of I0 or Power</description>
              <bitRange>[23:0]</bitRange>
            </field>
          </fields>
        </register>
        <!-- F0I3DAT -->
        <register>
          <name>F0I3DAT</name>
          <description>I3DAT Result register</description>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>I3DAT</name>
              <description>FIFO of I3 or Power</description>
              <bitRange>[23:0]</bitRange>
            </field>
          </fields>
        </register>
        <!-- F0VRMS -->
        <register>
          <name>F0VRMS</name>
          <description>VRMS Result register</description>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>VRMS</name>
              <description>RMS of V</description>
              <bitRange>[23:0]</bitRange>
            </field>
          </fields>
        </register>
        <!-- F0VRMS2 -->
        <register>
          <name>F0VRMS2</name>
          <description>VRMS^2 Result register</description>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>VRMS2</name>
              <description>RMS of V^2</description>
              <bitRange>[23:0]</bitRange>
            </field>
          </fields>
        </register>
        <!-- F0IRMS -->
        <register>
          <name>F0IRMS</name>
          <description>IRMS Result register</description>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>IRMS</name>
              <description>RMS of I</description>
              <bitRange>[23:0]</bitRange>
            </field>
          </fields>
        </register>
        <!-- F0IRMS2 -->
        <register>
          <name>F0IRMS2</name>
          <description>IRMS^2 Result register</description>
          <addressOffset>0x00000058</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>IRMS2</name>
              <description>RMS of I^2</description>
              <bitRange>[23:0]</bitRange>
            </field>
          </fields>
        </register>
        <!-- F0STAT -->
        <register>
          <name>F0STAT</name>
          <description>Status Register</description>
          <addressOffset>0x0000005C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x07FFFFFF</resetMask>
          <fields>
            <field>
              <name>VF_EMP</name><description>FIFO_VDAT is Empty</description>
              <bitRange>[0:0]</bitRange><access>read-only</access>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Disabled</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>Enabled</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="VF_EMP">
              <name>VF_FLL</name><description>FIFO_VDAT is Full</description>
              <bitRange>[1:1]</bitRange><access>read-only</access>
            </field>
            <field>
              <name>VF_OVER</name><description>FIFO_VDAT is Overflow</description>
              <bitRange>[2:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Disabled</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>Enabled</description><value>1</value></enumeratedValue>
              </enumeratedValues>          
            </field>
            <field derivedFrom="VF_EMP">
              <name>IF_EMP</name><description>FIFO_IDAT is Empty</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field derivedFrom="VF_EMP">
              <name>IF_FLL</name><description>FIFO_IDAT is Full</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field derivedFrom="VF_OVER">
              <name>IF_OVER</name><description>FIFO_IDAT is Overflow</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field derivedFrom="VF_OVER">
              <name>SAGF</name><description>V is less than CTRL2.SAGLVL</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field derivedFrom="VF_OVER">
              <name>PEAKVF</name><description>V exceeds F0MD1.VPKLVL</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field derivedFrom="VF_OVER">
              <name>PEAKIF</name><description>I exceeds F0MD1.VPKLVL</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field derivedFrom="VF_OVER">
              <name>WATTOVP</name><description>FxWATTP value overflow</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field derivedFrom="VF_OVER">
              <name>VAROVP</name><description>FxVARP value overflow</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field derivedFrom="VF_OVER">
              <name>VAOV</name><description>FxVR value overflow</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field derivedFrom="VF_OVER">
              <name>ZTXVF</name><description>Timeout of V cross zero</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ICHANNEL</name><description>Timeout of V cross zero</description>
              <bitRange>[13:13]</bitRange><access>read-only</access>
              <enumeratedValues>
                <enumeratedValue><name>I0</name><description>I0 is active</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>I3</name><description>I3 is active</description><value>1</value></enumeratedValue>
              </enumeratedValues>           
            </field>
            <field derivedFrom="VF_OVER">
              <name>FAULTCON</name><description>Active I switched</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field derivedFrom="VF_OVER">
              <name>APSIGN</name><description>ActivePower sign changed</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field derivedFrom="VF_EMP">
              <name>APNLDFL</name><description>ActivePower less CNTL1.APNOLOAD</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field derivedFrom="VF_OVER">
              <name>VARSIGN</name><description>ReactivePower sign changed</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field derivedFrom="VF_EMP">
              <name>VARNLDFL</name><description>ReactivePower less CNTL1.VARNOLOAD</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field derivedFrom="VF_EMP">
              <name>VANLDFL</name><description>FullPower less CNTL1.VANOLOAD</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field derivedFrom="VF_OVER">
              <name>ZEROCRS</name><description>V crossed zero</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field derivedFrom="VF_EMP">
              <name>I3F_EMP</name><description>FIFO_I3DAT is Empty</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field derivedFrom="VF_EMP">
              <name>I3F_FLL</name><description>FIFO_I3DAT is Full</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field derivedFrom="VF_OVER">
              <name>I3F_OVER</name><description>FIFO_I3DAT is Overflow</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field derivedFrom="VF_OVER">
              <name>WATTOVN</name><description>FxWATTN value overflow</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field derivedFrom="VF_OVER">
              <name>VAROVN</name><description>FxVARN value overflow</description>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
        <!-- F0MASK -->
        <register>
          <name>F0MASK</name>
          <description>IRQ Mask Register</description>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x07FFFFFF</resetMask>
          <fields>
            <field>
              <name>VF_EMPM</name><description>FIFO_VDAT is Empty</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Disabled</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>Enabled</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="VF_EMPM">
              <name>VF_FLLM</name><description>FIFO_VDAT is Full</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field derivedFrom="VF_EMPM">
              <name>VF_OVERM</name><description>FIFO_VDAT is Overflow</description>
              <bitRange>[2:2]</bitRange>      
            </field>
            <field derivedFrom="VF_EMPM">
              <name>IF_EMPM</name><description>FIFO_IDAT is Empty</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field derivedFrom="VF_EMPM">
              <name>IF_FLLM</name><description>FIFO_IDAT is Full</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field derivedFrom="VF_EMPM">
              <name>IF_OVERM</name><description>FIFO_IDAT is Overflow</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field derivedFrom="VF_EMPM">
              <name>SAGFM</name><description>V is less than CTRL2.SAGLVL</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field derivedFrom="VF_EMPM">
              <name>PEAKVFM</name><description>V exceeds F0MD1.VPKLVL</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field derivedFrom="VF_EMPM">
              <name>PEAKIFM</name><description>I exceeds F0MD1.VPKLVL</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field derivedFrom="VF_EMPM">
              <name>WATTOVPM</name><description>FxWATTP value overflow</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field derivedFrom="VF_EMPM">
              <name>VAROVPM</name><description>FxVARP value overflow</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field derivedFrom="VF_EMPM">
              <name>VAOVM</name><description>FxVR value overflow</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field derivedFrom="VF_EMPM">
              <name>ZTXVFM</name><description>Timeout of V cross zero</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field derivedFrom="VF_EMPM">
              <name>FAULTCONM</name><description>Active I switched</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field derivedFrom="VF_EMPM">
              <name>APSIGNM</name><description>ActivePower sign changed</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field derivedFrom="VF_EMPM">
              <name>APNLDFLM</name><description>ActivePower less CNTL1.APNOLOAD</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field derivedFrom="VF_EMPM">
              <name>VARSIGNM</name><description>ReactivePower sign changed</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field derivedFrom="VF_EMPM">
              <name>VARNLDFLM</name><description>ReactivePower less CNTL1.VARNOLOAD</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field derivedFrom="VF_EMPM">
              <name>VANLDFLM</name><description>FullPower less CNTL1.VANOLOAD</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field derivedFrom="VF_EMPM">
              <name>ZEROCRSM</name><description>V crossed zero</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field derivedFrom="VF_EMPM">
              <name>I3F_EMPM</name><description>FIFO_I3DAT is Empty</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field derivedFrom="VF_EMPM">
              <name>I3F_FLLM</name><description>FIFO_I3DAT is Full</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field derivedFrom="VF_EMPM">
              <name>I3F_OVERM</name><description>FIFO_I3DAT is Overflow</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field derivedFrom="VF_EMPM">
              <name>WATTOVNM</name><description>FxWATTN value overflow</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field derivedFrom="VF_EMPM">
              <name>VAROVNM</name><description>FxVARN value overflow</description>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
        <!-- F1CTR -->
        <register>
          <name>F1CTR</name>
          <description>FxCTR register</description>
          <addressOffset>0x00000064</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INTEN</name>
              <description>Integrator enable</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Disabled</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>Enabled</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>        
              <name>VASEL</name>
              <description>Select source for FullEnergy  </description>
              <bitRange>[2:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>FullEnergy</name><description>IDAT and VDAT can store FullEnergy</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>I_RMS</name><description>IDAT and VDAT can store I_RMS</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RARS</name>
              <description>Active Energy Accumulator Reset</description>
              <bitRange>[3:3]</bitRange>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue><name>Inactive</name><description>Inactive state</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Clear</name><description>Accumulator sets to zero</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="RARS">
              <name>RRRS</name>
              <description>Reactive Energy Accumulator Reset</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field derivedFrom="RARS">
              <name>RVRS</name>
              <description>Full Energy Accumulator Reset</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>IGAIN</name>
              <description>PGA value</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue><name>x1</name><description>Signal amplification 0dB</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>x2</name><description>Signal amplification 6dB</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>x4</name><description>Signal amplification 12dB</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>x8</name><description>Signal amplification 18dB</description><value>3</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="IGAIN">
              <name>VGAIN</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>VPHASE</name>
              <description>Phase V adjustment by step of +-124us</description>
              <bitRange>[17:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IRMSOS</name>
              <description>RMS calibration of channel I</description>
              <bitRange>[31:20]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- F1WC -->
        <register>
          <name>F1WC</name>
          <description>Active energy calibration</description>
          <addressOffset>0x00000068</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0FFFFFFF</resetMask>
          <fields>
            <field>
              <name>WATTOS</name>
              <description>Calibr bias of active energy</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>WGAIN</name>
              <description>Calibr gain of active energy</description>
              <bitRange>[27:16]</bitRange>
            </field>
            <!--Fields end-->
          </fields>
        </register>
        <!-- F1WATTP -->
        <register>
          <name>F1WATTP</name>
          <description>Positive Active Energy accumulator</description>
          <addressOffset>0x0000006C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WATTHRP</name>
              <description>High 32 bits of Accumulator</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <!-- F1WATTN -->
        <register>
          <name>F1WATTN</name>
          <description>Negative Active Energy accumulator</description>
          <addressOffset>0x00000070</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>      
          <fields>
            <field>
              <name>WATTHRN</name>
              <description>High 32 bits of 57bits Accumulator</description>
              <bitRange>[31:0]</bitRange>          
            </field>
          </fields>
        </register>
