lamer0k/CortexLib/Tools/RegistersGenerator/MDR1986VK234.svd
        <!-- F1VC -->
        <register>
          <name>F1VC</name>
          <description>Reactive energy calibration</description>
          <addressOffset>0x00000074</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0FFFFFFF</resetMask>
          <fields>
            <field>
              <name>VAROS</name>
              <description>Calibr bias of reactive energy</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>VARGAIN</name>
              <description>Calibr gain of reactive energy</description>
              <bitRange>[27:16]</bitRange>
            </field>
          </fields>
        </register>
        <!-- F1VARP -->
        <register>
          <name>F1VARP</name>
          <description>Positive Reactive Energy accumulator</description>
          <addressOffset>0x00000078</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VARHRP</name>
              <description>High 32 bits of of 57bits Accumulator</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <!-- F1VARN -->
        <register>
          <name>F1VARN</name>
          <description>Negative Reactive Energy accumulator</description>
          <addressOffset>0x0000007C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>      
          <fields>
            <field>
              <name>VARHRN</name>
              <description>High 32 bits of of 57bits Accumulator</description>
              <bitRange>[31:0]</bitRange>          
            </field>
          </fields>
        </register>
        <!-- F1AC -->
        <register>
          <name>F1AC</name>
          <description>V RMS calibration</description>
          <addressOffset>0x00000080</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0FFF0FFF</resetMask>
          <fields>
            <field>
              <name>VRMSOS</name>
              <description>Calibr bias of V RMS</description>
              <bitRange>[11:0]</bitRange>
            </field>
            <field>
              <name>VAGAIN</name>
              <description>Calibr gain of Full energy</description>
              <bitRange>[27:16]</bitRange>
            </field>
          </fields>
        </register>
        <!-- F1VR -->
        <register>
          <name>F1VR</name>
          <description>Full Energy accumulator</description>
          <addressOffset>0x00000084</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VAHR</name>
              <description>High 32 bits of of 57bits Accumulator</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <!-- F1MD0 -->
        <register>
          <name>F1MD0</name>
          <description>FxMD0 register</description>
          <addressOffset>0x00000088</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFF1FF</resetMask>
          <fields>
            <field>
              <name>VSEL</name>
              <description>Select source for FxVDAT</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>ADC_V</name><description>ADC_V output</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>ActivePower</name><description>Active Power</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>ReactivePower</name><description>Reactive Power</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>FullPower</name><description>Full Power</description><value>3</value></enumeratedValue>
              </enumeratedValues>          
            </field>
            <field>
              <name>ISEL</name>
              <description>Select source for FxI0DAT</description>
              <bitRange>[3:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>ADC_I</name><description>ADC_I output</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>ActivePower</name><description>Active Power</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>ReactivePower</name><description>Reactive Power</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>FullPower</name><description>Full Power</description><value>3</value></enumeratedValue>
              </enumeratedValues>          
            </field>
            <field>
              <name>ACTS</name>
              <description>Active Energy sign in last period</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue><name>Pos</name><description>Positive sign</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Neg</name><description>Negative sign</description><value>1</value></enumeratedValue>
              </enumeratedValues>          
            </field>
            <field derivedFrom="ACTS">
              <name>REACTS</name>
              <description>Reactive Energy sign in last period</description>
              <bitRange>[5:5]</bitRange>         
            </field>
            <field>
              <name>IGAIN</name>
              <description>ADC Decimation gain</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue><name>x1</name><description>No gain</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>x2</name><description>Gain by +6dB</description><value>1</value></enumeratedValue>
              </enumeratedValues>          
            </field>
            <field derivedFrom="IGAIN">
              <name>VGAIN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PER_FREQ</name>
              <description>Measured period of V</description>
              <bitRange>[28:12]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- F1MD1 -->
        <register>
          <name>F1MD1</name>
          <description>FxMD1 register</description>
          <addressOffset>0x0000008C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>IPKLVL</name>
              <description>Imax level</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>VPKLVL</name>
              <description>Vmax level</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <!-- F1MD2 -->
        <register>
          <name>F1MD2</name>
          <description>FxMD2 register</description>
          <addressOffset>0x00000090</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x001FFFF</resetMask>
          <fields>
            <field>
              <name>PhaseV_toV0</name>
              <description>Phase V1 ref to V0</description>
              <bitRange>[16:0]</bitRange>
            </field>
          </fields>
        </register>
        <!-- F1VPEAK -->
        <register>
          <name>F1VPEAK</name>
          <description>VPEAK Result register</description>
          <addressOffset>0x00000094</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>IPEAK</name>
              <description>Vmax measured, write any to clear</description>
              <bitRange>[23:0]</bitRange>
            </field>
          </fields>
        </register>
        <!-- F1IPEAK -->
        <register>
          <name>F1IPEAK</name>
          <description>IPEAK Result register</description>
          <addressOffset>0x00000098</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>IPEAK</name>
              <description>Imax measured, write any to clear</description>
              <bitRange>[23:0]</bitRange>
            </field>
          </fields>
        </register>    
