lamer0k/CortexLib/Tools/RegistersGenerator/MDR1986VK234.svd
        <!-- F1VDAT -->
        <register>
          <name>F1VDAT</name>
          <description>VDAT Result register</description>
          <addressOffset>0x0000009C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>VDAT</name>
              <description>FIFO of V or Power</description>
              <bitRange>[23:0]</bitRange>
            </field>
          </fields>
        </register>
        <!-- F1IDAT -->
        <register>
          <name>F1IDAT</name>
          <description>IDAT Result register</description>
          <addressOffset>0x000000A0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>IDAT</name>
              <description>FIFO of I or Power</description>
              <bitRange>[23:0]</bitRange>
            </field>
          </fields>
        </register>
        <!-- F1VRMS -->
        <register>
          <name>F1VRMS</name>
          <description>VRMS Result register</description>
          <addressOffset>0x000000A4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>VRMS</name>
              <description>RMS of V</description>
              <bitRange>[23:0]</bitRange>
            </field>
          </fields>
        </register>
        <!-- F1VRMS2 -->
        <register>
          <name>F1VRMS2</name>
          <description>VRMS^2 Result register</description>
          <addressOffset>0x000000A8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>VRMS2</name>
              <description>RMS of V^2</description>
              <bitRange>[23:0]</bitRange>
            </field>
          </fields>
        </register>
        <!-- F1IRMS -->
        <register>
          <name>F1IRMS</name>
          <description>IRMS Result register</description>
          <addressOffset>0x000000AC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>IRMS</name>
              <description>RMS of I</description>
              <bitRange>[23:0]</bitRange>
            </field>
          </fields>
        </register>
        <!-- F1IRMS2 -->
        <register>
          <name>F1IRMS2</name>
          <description>IRMS^2 Result register</description>
          <addressOffset>0x000000B0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>IRMS2</name>
              <description>RMS of I^2</description>
              <bitRange>[23:0]</bitRange>
            </field>
          </fields>
        </register>
        <!-- F1STAT -->
        <register>
          <name>F1STAT</name>
          <description>Status Register</description>
          <addressOffset>0x000000B4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x07FFFFFF</resetMask>
          <fields>
            <field>
              <name>VF_EMP</name><description>FIFO_VDAT is Empty</description>
              <bitRange>[0:0]</bitRange><access>read-only</access>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Disabled</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>Enabled</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="VF_EMP">
              <name>VF_FLL</name><description>FIFO_VDAT is Full</description>
              <bitRange>[1:1]</bitRange><access>read-only</access>
            </field>
            <field>
              <name>VF_OVER</name><description>FIFO_VDAT is Overflow</description>
              <bitRange>[2:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Disabled</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>Enabled</description><value>1</value></enumeratedValue>
              </enumeratedValues>          
            </field>
            <field derivedFrom="VF_EMP">
              <name>IF_EMP</name><description>FIFO_IDAT is Empty</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field derivedFrom="VF_EMP">
              <name>IF_FLL</name><description>FIFO_IDAT is Full</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field derivedFrom="VF_OVER">
              <name>IF_OVER</name><description>FIFO_IDAT is Overflow</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field derivedFrom="VF_OVER">
              <name>SAGF</name><description>V is less than CTRL2.SAGLVL</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field derivedFrom="VF_OVER">
              <name>PEAKVF</name><description>V exceeds F0MD1.VPKLVL</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field derivedFrom="VF_OVER">
              <name>PEAKIF</name><description>I exceeds F0MD1.VPKLVL</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field derivedFrom="VF_OVER">
              <name>WATTOVP</name><description>FxWATTP value overflow</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field derivedFrom="VF_OVER">
              <name>VAROVP</name><description>FxVARP value overflow</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field derivedFrom="VF_OVER">
              <name>VAOV</name><description>FxVR value overflow</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field derivedFrom="VF_OVER">
              <name>ZTXVF</name><description>Timeout of V cross zero</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field derivedFrom="VF_OVER">
              <name>APSIGN</name><description>ActivePower sign changed</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field derivedFrom="VF_EMP">
              <name>APNLDFL</name><description>ActivePower less CNTL1.APNOLOAD</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field derivedFrom="VF_OVER">
              <name>VARSIGN</name><description>ReactivePower sign changed</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field derivedFrom="VF_EMP">
              <name>VARNLDFL</name><description>ReactivePower less CNTL1.VARNOLOAD</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field derivedFrom="VF_EMP">
              <name>VANLDFL</name><description>FullPower less CNTL1.VANOLOAD</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field derivedFrom="VF_OVER">
              <name>ZEROCRS</name><description>V crossed zero</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field derivedFrom="VF_OVER">
              <name>WATTOVN</name><description>FxWATTN value overflow</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field derivedFrom="VF_OVER">
              <name>VAROVN</name><description>FxVARN value overflow</description>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
        <!-- F1MASK -->
        <register>
          <name>F1MASK</name>
          <description>IRQ Mask Register</description>
          <addressOffset>0x000000B8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x07FFFFFF</resetMask>
          <fields>
            <field>
              <name>VF_EMPM</name><description>FIFO_VDAT is Empty</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Disabled</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>Enabled</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="VF_EMPM">
              <name>VF_FLLM</name><description>FIFO_VDAT is Full</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field derivedFrom="VF_EMPM">
              <name>VF_OVERM</name><description>FIFO_VDAT is Overflow</description>
              <bitRange>[2:2]</bitRange>      
            </field>
            <field derivedFrom="VF_EMPM">
              <name>IF_EMPM</name><description>FIFO_IDAT is Empty</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field derivedFrom="VF_EMPM">
              <name>IF_FLLM</name><description>FIFO_IDAT is Full</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field derivedFrom="VF_EMPM">
              <name>IF_OVERM</name><description>FIFO_IDAT is Overflow</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field derivedFrom="VF_EMPM">
              <name>SAGFM</name><description>V is less than CTRL2.SAGLVL</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field derivedFrom="VF_EMPM">
              <name>PEAKVFM</name><description>V exceeds F0MD1.VPKLVL</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field derivedFrom="VF_EMPM">
              <name>PEAKIFM</name><description>I exceeds F0MD1.VPKLVL</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field derivedFrom="VF_EMPM">
              <name>WATTOVPM</name><description>FxWATTP value overflow</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field derivedFrom="VF_EMPM">
              <name>VAROVPM</name><description>FxVARP value overflow</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field derivedFrom="VF_EMPM">
              <name>VAOVM</name><description>FxVR value overflow</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field derivedFrom="VF_EMPM">
              <name>ZTXVFM</name><description>Timeout of V cross zero</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field derivedFrom="VF_EMPM">
              <name>APSIGNM</name><description>ActivePower sign changed</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field derivedFrom="VF_EMPM">
              <name>APNLDFLM</name><description>ActivePower less CNTL1.APNOLOAD</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field derivedFrom="VF_EMPM">
              <name>VARSIGNM</name><description>ReactivePower sign changed</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field derivedFrom="VF_EMPM">
              <name>VARNLDFLM</name><description>ReactivePower less CNTL1.VARNOLOAD</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field derivedFrom="VF_EMPM">
              <name>VANLDFLM</name><description>FullPower less CNTL1.VANOLOAD</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field derivedFrom="VF_EMPM">
              <name>ZEROCRSM</name><description>V crossed zero</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field derivedFrom="VF_EMPM">
              <name>WATTOVNM</name><description>FxWATTN value overflow</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field derivedFrom="VF_EMPM">
              <name>VAROVNM</name><description>FxVARN value overflow</description>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
        <!-- F2CTR -->
        <register>
          <name>F2CTR</name>
          <description>FxCTR register</description>
          <addressOffset>0x000000BC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INTEN</name>
              <description>Integrator enable</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Disabled</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>Enabled</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>        
              <name>VASEL</name>
              <description>Select source for FullEnergy  </description>
              <bitRange>[2:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>FullEnergy</name><description>IDAT and VDAT can store FullEnergy</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>I_RMS</name><description>IDAT and VDAT can store I_RMS</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RARS</name>
              <description>Active Energy Accumulator Reset</description>
              <bitRange>[3:3]</bitRange>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue><name>Inactive</name><description>Inactive state</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Clear</name><description>Accumulator sets to zero</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="RARS">
              <name>RRRS</name>
              <description>Reactive Energy Accumulator Reset</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field derivedFrom="RARS">
              <name>RVRS</name>
              <description>Full Energy Accumulator Reset</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>IGAIN</name>
              <description>PGA value</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue><name>x1</name><description>Signal amplification 0dB</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>x2</name><description>Signal amplification 6dB</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>x4</name><description>Signal amplification 12dB</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>x8</name><description>Signal amplification 18dB</description><value>3</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="IGAIN">
              <name>VGAIN</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>VPHASE</name>
              <description>Phase V adjustment by step of +-124us</description>
              <bitRange>[17:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IRMSOS</name>
              <description>RMS calibration of channel I</description>
              <bitRange>[31:20]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
