lamer0k/CortexLib/Tools/RegistersGenerator/MDR1986VK234.svd
        <!-- F2WC -->
        <register>
          <name>F2WC</name>
          <description>Active energy calibration</description>
          <addressOffset>0x000000C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0FFFFFFF</resetMask>
          <fields>
            <field>
              <name>WATTOS</name>
              <description>Calibr bias of active energy</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>WGAIN</name>
              <description>Calibr gain of active energy</description>
              <bitRange>[27:16]</bitRange>
            </field>
          </fields>
        </register>
        <!-- F2WATTP -->
        <register>
          <name>F2WATTP</name>
          <description>Positive Active Energy accumulator</description>
          <addressOffset>0x000000C4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WATTHRP</name>
              <description>High 32 bits of Accumulator</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <!-- F2WATTN -->
        <register>
          <name>F2WATTN</name>
          <description>Negative Active Energy accumulator</description>
          <addressOffset>0x000000C8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>      
          <fields>
            <field>
              <name>WATTHRN</name>
              <description>High 32 bits of 57bits Accumulator</description>
              <bitRange>[31:0]</bitRange>          
            </field>
          </fields>
        </register>
        <!-- F2VC -->
        <register>
          <name>F2VC</name>
          <description>Reactive energy calibration</description>
          <addressOffset>0x000000CC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0FFFFFFF</resetMask>
          <fields>
            <field>
              <name>VAROS</name>
              <description>Calibr bias of reactive energy</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>VARGAIN</name>
              <description>Calibr gain of reactive energy</description>
              <bitRange>[27:16]</bitRange>
            </field>
          </fields>
        </register>
        <!-- F2VARP -->
        <register>
          <name>F2VARP</name>
          <description>Positive Reactive Energy accumulator</description>
          <addressOffset>0x000000D0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VARHRP</name>
              <description>High 32 bits of of 57bits Accumulator</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <!-- F2VARN -->
        <register>
          <name>F2VARN</name>
          <description>Negative Reactive Energy accumulator</description>
          <addressOffset>0x000000D4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>      
          <fields>
            <field>
              <name>VARHRN</name>
              <description>High 32 bits of of 57bits Accumulator</description>
              <bitRange>[31:0]</bitRange>          
            </field>
          </fields>
        </register>
        <!-- F2AC -->
        <register>
          <name>F2AC</name>
          <description>V RMS calibration</description>
          <addressOffset>0x000000D8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0FFF0FFF</resetMask>
          <fields>
            <field>
              <name>VRMSOS</name>
              <description>Calibr bias of V RMS</description>
              <bitRange>[11:0]</bitRange>
            </field>
            <field>
              <name>VAGAIN</name>
              <description>Calibr gain of Full energy</description>
              <bitRange>[27:16]</bitRange>
            </field>
          </fields>
        </register>
        <!-- F2VR -->
        <register>
          <name>F2VR</name>
          <description>Full Energy accumulator</description>
          <addressOffset>0x000000DC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VAHR</name>
              <description>High 32 bits of of 57bits Accumulator</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <!-- F2MD0 -->
        <register>
          <name>F2MD0</name>
          <description>FxMD0 register</description>
          <addressOffset>0x000000E0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFF1FF</resetMask>
          <fields>
            <field>
              <name>VSEL</name>
              <description>Select source for FxVDAT</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>ADC_V</name><description>ADC_V output</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>ActivePower</name><description>Active Power</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>ReactivePower</name><description>Reactive Power</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>FullPower</name><description>Full Power</description><value>3</value></enumeratedValue>
              </enumeratedValues>          
            </field>
            <field>
              <name>ISEL</name>
              <description>Select source for FxI0DAT</description>
              <bitRange>[3:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>ADC_I</name><description>ADC_I output</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>ActivePower</name><description>Active Power</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>ReactivePower</name><description>Reactive Power</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>FullPower</name><description>Full Power</description><value>3</value></enumeratedValue>
              </enumeratedValues>          
            </field>
            <field>
              <name>ACTS</name>
              <description>Active Energy sign in last period</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue><name>Pos</name><description>Positive sign</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Neg</name><description>Negative sign</description><value>1</value></enumeratedValue>
              </enumeratedValues>          
            </field>
            <field derivedFrom="ACTS">
              <name>REACTS</name>
              <description>Reactive Energy sign in last period</description>
              <bitRange>[5:5]</bitRange>         
            </field>
            <field>
              <name>IGAIN</name>
              <description>ADC Decimation gain</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue><name>x1</name><description>No gain</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>x2</name><description>Gain by +6dB</description><value>1</value></enumeratedValue>
              </enumeratedValues>          
            </field>
            <field derivedFrom="IGAIN">
              <name>VGAIN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PER_FREQ</name>
              <description>Measured period of V</description>
              <bitRange>[28:12]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- F2MD1 -->
        <register>
          <name>F2MD1</name>
          <description>FxMD1 register</description>
          <addressOffset>0x000000E4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>IPKLVL</name>
              <description>Imax level</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>VPKLVL</name>
              <description>Vmax level</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <!-- F2MD2 -->
        <register>
          <name>F2MD2</name>
          <description>FxMD2 register</description>
          <addressOffset>0x000000E8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x001FFFF</resetMask>
          <fields>
            <field>
              <name>PhaseV_toV0</name>
              <description>Phase V1 ref to V0</description>
              <bitRange>[16:0]</bitRange>
            </field>
          </fields>
        </register>
        <!-- F2VPEAK -->
        <register>
          <name>F2VPEAK</name>
          <description>VPEAK Result register</description>
          <addressOffset>0x000000EC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>IPEAK</name>
              <description>Vmax measured, write any to clear</description>
              <bitRange>[23:0]</bitRange>
            </field>
          </fields>
        </register>
        <!-- F2IPEAK -->
        <register>
          <name>F2IPEAK</name>
          <description>IPEAK Result register</description>
          <addressOffset>0x000000F0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>IPEAK</name>
              <description>Imax measured, write any to clear</description>
              <bitRange>[23:0]</bitRange>
            </field>
          </fields>
        </register>    
        <!-- F2VDAT -->
        <register>
          <name>F2VDAT</name>
          <description>VDAT Result register</description>
          <addressOffset>0x000000F4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>VDAT</name>
              <description>FIFO of V or Power</description>
              <bitRange>[23:0]</bitRange>
            </field>
          </fields>
        </register>
        <!-- F2IDAT -->
        <register>
          <name>F2IDAT</name>
          <description>IDAT Result register</description>
          <addressOffset>0x000000F8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>IDAT</name>
              <description>FIFO of I or Power</description>
              <bitRange>[23:0]</bitRange>
            </field>
          </fields>
        </register>
        <!-- F2VRMS -->
        <register>
          <name>F2VRMS</name>
          <description>VRMS Result register</description>
          <addressOffset>0x000000FC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>VRMS</name>
              <description>RMS of V</description>
              <bitRange>[23:0]</bitRange>
            </field>
          </fields>
        </register>
        <!-- F2VRMS2 -->
        <register>
          <name>F2VRMS2</name>
          <description>VRMS^2 Result register</description>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>VRMS2</name>
              <description>RMS of V^2</description>
              <bitRange>[23:0]</bitRange>
            </field>
          </fields>
        </register>
        <!-- F2IRMS -->
        <register>
          <name>F2IRMS</name>
          <description>IRMS Result register</description>
          <addressOffset>0x00000104</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>IRMS</name>
              <description>RMS of I</description>
              <bitRange>[23:0]</bitRange>
            </field>
          </fields>
        </register>
        <!-- F2IRMS2 -->
        <register>
          <name>F2IRMS2</name>
          <description>IRMS^2 Result register</description>
          <addressOffset>0x00000108</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>IRMS2</name>
              <description>RMS of I^2</description>
              <bitRange>[23:0]</bitRange>
            </field>
          </fields>
        </register>
        <!-- F2STAT -->
        <register>
          <name>F2STAT</name>
          <description>Status Register</description>
          <addressOffset>0x0000010C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x07FFFFFF</resetMask>
          <fields>
            <field>
              <name>VF_EMP</name><description>FIFO_VDAT is Empty</description>
              <bitRange>[0:0]</bitRange><access>read-only</access>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Disabled</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>Enabled</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="VF_EMP">
              <name>VF_FLL</name><description>FIFO_VDAT is Full</description>
              <bitRange>[1:1]</bitRange><access>read-only</access>
            </field>
            <field>
              <name>VF_OVER</name><description>FIFO_VDAT is Overflow</description>
              <bitRange>[2:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Disabled</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>Enabled</description><value>1</value></enumeratedValue>
              </enumeratedValues>          
            </field>
            <field derivedFrom="VF_EMP">
              <name>IF_EMP</name><description>FIFO_IDAT is Empty</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field derivedFrom="VF_EMP">
              <name>IF_FLL</name><description>FIFO_IDAT is Full</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field derivedFrom="VF_OVER">
              <name>IF_OVER</name><description>FIFO_IDAT is Overflow</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field derivedFrom="VF_OVER">
              <name>SAGF</name><description>V is less than CTRL2.SAGLVL</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field derivedFrom="VF_OVER">
              <name>PEAKVF</name><description>V exceeds F0MD1.VPKLVL</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field derivedFrom="VF_OVER">
              <name>PEAKIF</name><description>I exceeds F0MD1.VPKLVL</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field derivedFrom="VF_OVER">
              <name>WATTOVP</name><description>FxWATTP value overflow</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field derivedFrom="VF_OVER">
              <name>VAROVP</name><description>FxVARP value overflow</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field derivedFrom="VF_OVER">
              <name>VAOV</name><description>FxVR value overflow</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field derivedFrom="VF_OVER">
              <name>ZTXVF</name><description>Timeout of V cross zero</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field derivedFrom="VF_OVER">
              <name>APSIGN</name><description>ActivePower sign changed</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field derivedFrom="VF_EMP">
              <name>APNLDFL</name><description>ActivePower less CNTL1.APNOLOAD</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field derivedFrom="VF_OVER">
              <name>VARSIGN</name><description>ReactivePower sign changed</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field derivedFrom="VF_EMP">
              <name>VARNLDFL</name><description>ReactivePower less CNTL1.VARNOLOAD</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field derivedFrom="VF_EMP">
              <name>VANLDFL</name><description>FullPower less CNTL1.VANOLOAD</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field derivedFrom="VF_OVER">
              <name>ZEROCRS</name><description>V crossed zero</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field derivedFrom="VF_OVER">
              <name>WATTOVN</name><description>FxWATTN value overflow</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field derivedFrom="VF_OVER">
              <name>VAROVN</name><description>FxVARN value overflow</description>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
