lamer0k/CortexLib/Tools/RegistersGenerator/MDR1986VK234.svd
       <!-- F2MASK -->
        <register>
          <name>F2MASK</name>
          <description>IRQ Mask Register</description>
          <addressOffset>0x00000110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x07FFFFFF</resetMask>
          <fields>
            <field>
              <name>VF_EMPM</name><description>FIFO_VDAT is Empty</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Disabled</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>Enabled</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="VF_EMPM">
              <name>VF_FLLM</name><description>FIFO_VDAT is Full</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field derivedFrom="VF_EMPM">
              <name>VF_OVERM</name><description>FIFO_VDAT is Overflow</description>
              <bitRange>[2:2]</bitRange>      
            </field>
            <field derivedFrom="VF_EMPM">
              <name>IF_EMPM</name><description>FIFO_IDAT is Empty</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field derivedFrom="VF_EMPM">
              <name>IF_FLLM</name><description>FIFO_IDAT is Full</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field derivedFrom="VF_EMPM">
              <name>IF_OVERM</name><description>FIFO_IDAT is Overflow</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field derivedFrom="VF_EMPM">
              <name>SAGFM</name><description>V is less than CTRL2.SAGLVL</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field derivedFrom="VF_EMPM">
              <name>PEAKVFM</name><description>V exceeds F0MD1.VPKLVL</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field derivedFrom="VF_EMPM">
              <name>PEAKIFM</name><description>I exceeds F0MD1.VPKLVL</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field derivedFrom="VF_EMPM">
              <name>WATTOVPM</name><description>FxWATTP value overflow</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field derivedFrom="VF_EMPM">
              <name>VAROVPM</name><description>FxVARP value overflow</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field derivedFrom="VF_EMPM">
              <name>VAOVM</name><description>FxVR value overflow</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field derivedFrom="VF_EMPM">
              <name>ZTXVFM</name><description>Timeout of V cross zero</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field derivedFrom="VF_EMPM">
              <name>APSIGNM</name><description>ActivePower sign changed</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field derivedFrom="VF_EMPM">
              <name>APNLDFLM</name><description>ActivePower less CNTL1.APNOLOAD</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field derivedFrom="VF_EMPM">
              <name>VARSIGNM</name><description>ReactivePower sign changed</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field derivedFrom="VF_EMPM">
              <name>VARNLDFLM</name><description>ReactivePower less CNTL1.VARNOLOAD</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field derivedFrom="VF_EMPM">
              <name>VANLDFLM</name><description>FullPower less CNTL1.VANOLOAD</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field derivedFrom="VF_EMPM">
              <name>ZEROCRSM</name><description>V crossed zero</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field derivedFrom="VF_EMPM">
              <name>WATTOVNM</name><description>FxWATTN value overflow</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field derivedFrom="VF_EMPM">
              <name>VAROVNM</name><description>FxVARN value overflow</description>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
        <!-- CCAL1 -->
        <register>
          <name>CCAL1</name>
          <description>Calibration Register 1</description>
          <addressOffset>0x00000114</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>V0BGAIN</name>
              <description>V0 calibration gain</description>
              <bitRange>[11:0]</bitRange>
            </field>
            <field>
              <name>I0BGAIN</name>
              <description>I0 calibration gain</description>
              <bitRange>[23:12]</bitRange>
            </field>
          </fields>
        </register>
        <!-- CCAL2 -->
        <register>
          <name>CCAL2</name>
          <description>Calibration Register 2</description>
          <addressOffset>0x00000118</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>V1BGAIN</name>
              <description>V1 calibration gain</description>
              <bitRange>[11:0]</bitRange>
            </field>
            <field>
              <name>I1BGAIN</name>
              <description>I1 calibration gain</description>
              <bitRange>[23:12]</bitRange>
            </field>
          </fields>
        </register>
        <!-- CCAL3 -->
        <register>
          <name>CCAL3</name>
          <description>Calibration Register 3</description>
          <addressOffset>0x0000011C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>V2BGAIN</name>
              <description>V2 calibration gain</description>
              <bitRange>[11:0]</bitRange>
            </field>
            <field>
              <name>I2BGAIN</name>
              <description>I2 calibration gain</description>
              <bitRange>[23:12]</bitRange>
            </field>
          </fields>
        </register>
        <!-- CCAL4 -->
        <register>
          <name>CCAL4</name>
          <description>Calibration Register 4</description>
          <addressOffset>0x00000120</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FFF</resetMask>
          <fields>
            <field>
              <name>I3BGAIN</name>
              <description>I3 calibration gain</description>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
        <!-- Registers end-->
      </registers>
      <!-- peripheral end-->
    </peripheral>

    <!-- #CRC -->
    <!-- CRC_VE4 -->
    <peripheral>
      <name>MDR_CRC_VE4</name>
      <version>1.0</version>
      <description>CRC Controler</description>
      <groupName>CRC</groupName>
      <baseAddress>0x40098000</baseAddress>
      <size>32</size>
      <access>read-write</access>
      <addressBlock>
        <offset>0</offset>
        <size>0x14</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <!-- CTRL -->
        <register>
          <name>CTRL</name>
          <description>Control register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000000</resetValue>
          <resetMask>0x0000003F</resetMask>
          <fields>
            <field>
              <name>CRCEn</name>
              <description>Enable block</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Disabled</name><description>Block inactive</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Enabled</name><description>Block active</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DataInv</name>
              <description>Bit first selection</description>
              <bitRange>[1:1]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>LSB</name><description>Low bit first</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>MSB</name><description>High bit first</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA_En</name>
              <description>DMA Enable</description>
              <bitRange>[2:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Disabled</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>Enabled</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DL_Size</name>
              <description>Loading data size</description>
              <bitRange>[4:3]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Byte</name><description>Byte data stream</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>16_bit</name><description>16-bit data stream</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>32_bit</name><description>32-bit data stream</description><value>2</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DC_Size</name>
              <description>Calculating data size</description>
              <bitRange>[6:5]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Byte</name><description>Byte data word</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>16_bit</name><description>16-bit data word</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>32_bit</name><description>32-bit data word</description><value>2</value></enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>  
        </register>
