lamer0k/CortexLib/Tools/RegistersGenerator/MDR1986VK234.svd
        <!--FBRD-->
        <register>
          <name>FBRD</name>
          <description>Fractional BaudRate Divisor</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000003F</resetMask>
          <fields>
            <field>
              <name>Baud_DivFrac</name>
              <description>Fractional part of Rate divisor</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--LCR_H-->
        <register>
          <name>LCR_H</name>
          <description>Line Control Register</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>BRK</name>
              <description>Send Break - TX LOW for 2 words</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Disabled</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>Enabled</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="BRK">
              <name>PEN</name>
              <description>Parity Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPS</name>
              <description>Even Parity Select</description>
              <bitRange>[2:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Odd</name><description>Odd parity bit</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Even</name><description>Even parity bit</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="BRK">
              <name>STP2</name>
              <description>Double Stop Bits Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field derivedFrom="BRK">
              <name>FEN</name>
              <description>FIFOs Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>WLEN</name>
              <description>Word Length</description>
              <bitRange>[6:5]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>bit_5</name><description>Word bits length</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>bit_6</name><description>Word bits length</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>bit_7</name><description>Word bits length</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>bit_8</name><description>Word bits length</description><value>3</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="BRK">
              <name>SPS</name>
              <description>Stick Parity Select</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>      
        </register>    
        <!--CR-->
        <register>
          <name>CR</name>
          <description>Control Register</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FF87</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable UART</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Disabled</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>Enabled</description><value>1</value></enumeratedValue>
              </enumeratedValues>          
            </field>
            <field derivedFrom="EN">
              <name>SIREN</name>
              <description>IrDA Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field derivedFrom="EN">
              <name>SIRLP</name>
              <description>IrDA Low-Power Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field derivedFrom="EN">
              <name>LBE</name>
              <description>LoopBack Enable</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field derivedFrom="EN">
              <name>TXE</name>
              <description>Transmitter Enable</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field derivedFrom="EN">
              <name>RXE</name>
              <description>Receiver Enable</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>DTR</name>
              <description>Data Transmit Ready</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue><name>Inactive</name><description>Sets modem line to Inactive</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Active</name><description>Sets modem line to Active</description><value>1</value></enumeratedValue>
              </enumeratedValues>          
            </field>
            <field derivedFrom="DTR">
              <name>RTS</name>
              <description>Request To Send</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field derivedFrom="DTR">
              <name>Out1</name>
              <description>Custom Modem Output1 - DCD</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field derivedFrom="DTR">
              <name>Out2</name>
              <description>Custom Modem Output2 - RI</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field derivedFrom="EN">
              <name>RTSEn</name>
              <description>Hardware RTS Control</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field derivedFrom="EN">
              <name>CTSEn</name>
              <description>Hardware CTS Control</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <!--IFLS-->
        <register>
          <name>IFLS</name>
          <description>IRQ FIFO Level</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000003F</resetMask>
          <fields>
            <field>
              <name>TXIFLSES</name>
              <description>IRQ FIFO_TX level</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue><name>Words_le4</name><description>Less or Equal words in FIFO_TX</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Words_le8</name><description>Less or Equal words in FIFO_TX</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>Words_le16</name><description>Less or Equal words in FIFO_TX</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>Words_le24</name><description>Less or Equal words in FIFO_TX</description><value>3</value></enumeratedValue>
                <enumeratedValue><name>Words_le32</name><description>Less or Equal words in FIFO_TX</description><value>4</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXIFLSES</name>
              <description>IRQ FIFO_RX level</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue><name>Words_ge4</name><description>Greater or Equal words in FIFO_RX</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Words_ge8</name><description>Greater or Equal words in FIFO_RX</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>Words_ge16</name><description>Greater or Equal words in FIFO_RX</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>Words_ge24</name><description>Greater or Equal words in FIFO_RX</description><value>3</value></enumeratedValue>
                <enumeratedValue><name>Words_ge32</name><description>Greater or Equal words in FIFO_RX</description><value>4</value></enumeratedValue>
              </enumeratedValues>             
            </field>
          </fields>
        </register>
        <!--IMSC-->
        <register>
          <name>IMSC</name>
          <description>IRQ Mask Set Clear</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FF</resetMask>
          <fields>
            <field>
              <name>RIM_IM</name>
              <description>RI Modem IRQ Mask</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>IRQ Disabled</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>IRQ Enabled</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="RIM_IM">
              <name>STCM_IM</name>
              <description>STC Modem IRQ Mask</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field derivedFrom="RIM_IM">
              <name>DCDM_IM</name>
              <description>DCD Modem IRQ Mask</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field derivedFrom="RIM_IM">
              <name>DSRM_IM</name>
              <description>DSR Modem IRQ Mask</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field derivedFrom="RIM_IM">
              <name>RX_IM</name>
              <description>RX IRQ Mask</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field derivedFrom="RIM_IM">
              <name>TX_IM</name>
              <description>TX IRQ Mask</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field derivedFrom="RIM_IM">
              <name>RT_IM</name>
              <description>RX Timeout IRQ Mask</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field derivedFrom="RIM_IM">
              <name>FE_IM</name>
              <description>Frame Error IRQ Mask</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field derivedFrom="RIM_IM">
              <name>PE_IM</name>
              <description>Parity Error IRQ Mask</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field derivedFrom="RIM_IM">
              <name>BE_IM</name>
              <description>BreakLine IRQ Mask</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field derivedFrom="RIM_IM">
              <name>OE_IM</name>
              <description>Overrun FIFO_RX IRQ Mask</description>
              <bitRange>[10:10]</bitRange>
            </field>
          </fields>
        </register>
