lamer0k/CortexLib/Tools/RegistersGenerator/MDR1986VK234.svd
        <!--IE-->
        <register>
          <name>IE</name>
          <description>IRQ Enable</description>
          <addressOffset>0x00000058</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0001FFFF</resetMask>
          <fields>
            <field>
              <name>CNT_ZERO_IE</name>
              <description>CNT Zero</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Disable</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>ENable</description><value>1</value></enumeratedValue>
              </enumeratedValues>          
            </field>
            <field derivedFrom="CNT_ZERO_IE">
              <name>CNT_ARR_IE</name>
              <description>CNT eq ARR</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field derivedFrom="CNT_ZERO_IE">
              <name>ETR_RE_IE</name>
              <description>ETR Rise Front</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field derivedFrom="CNT_ZERO_IE">
              <name>ETR_FE_IE</name>
              <description>ETR Fall Front</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field derivedFrom="CNT_ZERO_IE">
              <name>BRK_IE</name>
              <description>BRK High Level</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field derivedFrom="CNT_ZERO_IE">
              <name>CCR_CAP_CH1_IE</name>
              <description>Captured to CCR</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field derivedFrom="CCR_CAP_CH1_IE">
              <name>CCR_CAP_CH2_IE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field derivedFrom="CCR_CAP_CH1_IE">
              <name>CCR_CAP_CH3_IE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field derivedFrom="CCR_CAP_CH1_IE">
              <name>CCR_CAP_CH4_IE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field derivedFrom="CNT_ZERO_IE">
              <name>CCR_REF_CH1_IE</name>
              <description>PWM Rise Front</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field derivedFrom="CCR_REF_CH1_IE">
              <name>CCR_REF_CH2_IE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field derivedFrom="CCR_REF_CH1_IE">
              <name>CCR_REF_CH3_IE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field derivedFrom="CCR_REF_CH1_IE">
              <name>CCR_REF_CH4_IE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field derivedFrom="CNT_ZERO_IE">
              <name>CCR1_CAP_CH1_IE</name>
              <description>Captured to CCR1</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field derivedFrom="CCR1_CAP_CH1_IE">
              <name>CCR1_CAP_CH2_IE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field derivedFrom="CCR1_CAP_CH1_IE">
              <name>CCR1_CAP_CH3_IE</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field derivedFrom="CCR1_CAP_CH1_IE">
              <name>CCR1_CAP_CH4_IE</name>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <!--DMA_RE-->
        <register>
          <name>DMA_RE</name>
          <description>DMA Request Enable for TIMx_DMA_REQ</description>
          <addressOffset>0x0000005C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0001FFFF</resetMask>
          <fields>
            <field>
              <name>CNT_ZERO_DMAE</name>
              <description>CNT Zero</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Inactive</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>Active</description><value>1</value></enumeratedValue>
              </enumeratedValues>          
            </field>
            <field derivedFrom="CNT_ZERO_DMAE">
              <name>CNT_ARR_DMAE</name>
              <description>CNT eq ARR</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field derivedFrom="CNT_ZERO_DMAE">
              <name>ETR_RE_DMAE</name>
              <description>ETR Rise Front</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field derivedFrom="CNT_ZERO_DMAE">
              <name>ETR_FE_DMAE</name>
              <description>ETR Fall Front</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field derivedFrom="CNT_ZERO_DMAE">
              <name>BRK_DMAE</name>
              <description>BRK High Level</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field derivedFrom="CNT_ZERO_DMAE">
              <name>CCR_CAP_CH1_DMAE</name>
              <description>Captured to CCR</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field derivedFrom="CCR_CAP_CH1_DMAE">
              <name>CCR_CAP_CH2_DMAE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field derivedFrom="CCR_CAP_CH1_DMAE">
              <name>CCR_CAP_CH3_DMAE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field derivedFrom="CCR_CAP_CH1_DMAE">
              <name>CCR_CAP_CH4_DMAE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field derivedFrom="CNT_ZERO_DMAE">
              <name>CCR_REF_CH1_DMAE</name>
              <description>PWM Rise Front</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field derivedFrom="CCR_REF_CH1_DMAE">
              <name>CCR_REF_CH2_DMAE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field derivedFrom="CCR_REF_CH1_DMAE">
              <name>CCR_REF_CH3_DMAE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field derivedFrom="CCR_REF_CH1_DMAE">
              <name>CCR_REF_CH4_DMAE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field derivedFrom="CNT_ZERO_DMAE">
              <name>CCR1_CAP_CH1_DMAE</name>
              <description>Captured to CCR1</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field derivedFrom="CCR1_CAP_CH1_DMAE">
              <name>CCR1_CAP_CH2_DMAE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field derivedFrom="CCR1_CAP_CH1_DMAE">
              <name>CCR1_CAP_CH3_DMAE</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field derivedFrom="CCR1_CAP_CH1_DMAE">
              <name>CCR1_CAP_CH4_DMAE</name>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
